In [3]:
#imports
#numpy,pandas,scipy,math,matplotlib
import numpy as np
import pandas as pd
import scipy
from math import sqrt
import matplotlib.pyplot as plt

#estimators
from sklearn.ensemble import RandomForestRegressor
from sklearn.linear_model import LinearRegression
from sklearn.svm import SVR
from sklearn import linear_model
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score, classification_report
from sklearn.ensemble import RandomForestClassifier, GradientBoostingClassifier
from sklearn.tree import DecisionTreeClassifier
from sklearn.model_selection import cross_val_score
from sklearn.preprocessing import KBinsDiscretizer
from sklearn import preprocessing

#model metrics
from sklearn.metrics import mean_squared_error
from sklearn.metrics import r2_score
from sklearn.model_selection import cross_val_score

#cross validation
from sklearn.model_selection import train_test_split

#math
from math import sqrt

In [4]:
#data
rawData = pd.read_csv('Credit_2.csv')
rawData.head()

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
0,1,20000,female,university,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,default
1,2,120000,female,university,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,default
2,3,90000,female,university,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,not default
3,4,50000,female,university,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,not default
4,5,50000,male,university,1,57,-1,0,-1,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,not default

In [5]:
rawData.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30000 entries, 0 to 29999
Data columns (total 25 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   ID                          30000 non-null  int64
 1   LIMIT_BAL                   30000 non-null  int64
 2   SEX                         30000 non-null  object
 3   EDUCATION                   30000 non-null  object
 4   MARRIAGE                    30000 non-null  int64
 5   AGE                         30000 non-null  int64
 6   PAY_0                       30000 non-null  int64
 7   PAY_2                       30000 non-null  int64
 8   PAY_3                       30000 non-null  int64
 9   PAY_4                       30000 non-null  int64
 10  PAY_5                       30000 non-null  int64
 11  PAY_6                       30000 non-null  int64
 12  BILL_AMT1                   30000 non-null  int64
 13  BILL_AMT2                   30000 non-null  int64
 14  BILL_AMT3                   30000 non-null  int64
 15  BILL_AMT4                   30000 non-null  int64
 16  BILL_AMT5                   30000 non-null  int64
 17  BILL_AMT6                   30000 non-null  int64
 18  PAY_AMT1                    30000 non-null  int64
 19  PAY_AMT2                    30000 non-null  int64
 20  PAY_AMT3                    30000 non-null  int64
 21  PAY_AMT4                    30000 non-null  int64
 22  PAY_AMT5                    30000 non-null  int64
 23  PAY_AMT6                    30000 non-null  int64
 24  default payment next month  30000 non-null  object
dtypes: int64(22), object(3)
memory usage: 5.7+ MB

In [6]:
#dealing with non-numeric data- one-hot encoding
#converting all object variables to binary featues that one 0 and 1 classes 
rawData = pd.get_dummies(rawData)
print (rawData)

          ID  LIMIT_BAL  MARRIAGE  AGE  PAY_0  PAY_2  PAY_3  PAY_4  PAY_5  \
0          1      20000         1   24      2      2     -1     -1     -2
1          2     120000         2   26     -1      2      0      0      0
2          3      90000         2   34      0      0      0      0      0
3          4      50000         1   37      0      0      0      0      0
4          5      50000         1   57     -1      0     -1      0      0
...      ...        ...       ...  ...    ...    ...    ...    ...    ...
29995  29996     220000         1   39      0      0      0      0      0
29996  29997     150000         2   43     -1     -1     -1     -1      0
29997  29998      30000         2   37      4      3      2     -1      0
29998  29999      80000         1   41      1     -1      0      0      0
29999  30000      50000         1   46      0      0      0      0      0

       PAY_6  ...  PAY_AMT5  PAY_AMT6  SEX_female  SEX_male  \
0         -2  ...         0         0           1         0
1          2  ...         0      2000           1         0
2          0  ...      1000      5000           1         0
3          0  ...      1069      1000           1         0
4          0  ...       689       679           0         1
...      ...  ...       ...       ...         ...       ...
29995      0  ...      5000      1000           0         1
29996      0  ...         0         0           0         1
29997      0  ...      2000      3100           0         1
29998     -1  ...     52964      1804           0         1
29999      0  ...      1000      1000           0         1

       EDUCATION_graduate school  EDUCATION_high school  EDUCATION_other  \
0                              0                      0                0
1                              0                      0                0
2                              0                      0                0
3                              0                      0                0
4                              0                      0                0
...                          ...                    ...              ...
29995                          0                      1                0
29996                          0                      1                0
29997                          0                      0                0
29998                          0                      1                0
29999                          0                      0                0

       EDUCATION_university  default payment next month_default  \
0                         1                                   1
1                         1                                   1
2                         1                                   0
3                         1                                   0
4                         1                                   0
...                     ...                                 ...
29995                     0                                   0
29996                     0                                   0
29997                     1                                   1
29998                     0                                   1
29999                     1                                   1

       default payment next month_not default
0                                           0
1                                           0
2                                           1
3                                           1
4                                           1
...                                       ...
29995                                       1
29996                                       1
29997                                       0
29998                                       0
29999                                       0

[30000 rows x 30 columns]

In [7]:
rawData.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30000 entries, 0 to 29999
Data columns (total 30 columns):
 #   Column                                  Non-Null Count  Dtype
---  ------                                  --------------  -----
 0   ID                                      30000 non-null  int64
 1   LIMIT_BAL                               30000 non-null  int64
 2   MARRIAGE                                30000 non-null  int64
 3   AGE                                     30000 non-null  int64
 4   PAY_0                                   30000 non-null  int64
 5   PAY_2                                   30000 non-null  int64
 6   PAY_3                                   30000 non-null  int64
 7   PAY_4                                   30000 non-null  int64
 8   PAY_5                                   30000 non-null  int64
 9   PAY_6                                   30000 non-null  int64
 10  BILL_AMT1                               30000 non-null  int64
 11  BILL_AMT2                               30000 non-null  int64
 12  BILL_AMT3                               30000 non-null  int64
 13  BILL_AMT4                               30000 non-null  int64
 14  BILL_AMT5                               30000 non-null  int64
 15  BILL_AMT6                               30000 non-null  int64
 16  PAY_AMT1                                30000 non-null  int64
 17  PAY_AMT2                                30000 non-null  int64
 18  PAY_AMT3                                30000 non-null  int64
 19  PAY_AMT4                                30000 non-null  int64
 20  PAY_AMT5                                30000 non-null  int64
 21  PAY_AMT6                                30000 non-null  int64
 22  SEX_female                              30000 non-null  uint8
 23  SEX_male                                30000 non-null  uint8
 24  EDUCATION_graduate school               30000 non-null  uint8
 25  EDUCATION_high school                   30000 non-null  uint8
 26  EDUCATION_other                         30000 non-null  uint8
 27  EDUCATION_university                    30000 non-null  uint8
 28  default payment next month_default      30000 non-null  uint8
 29  default payment next month_not default  30000 non-null  uint8
dtypes: int64(22), uint8(8)
memory usage: 5.3 MB

In [8]:
#df = rawData.iloc[:,:-3]
#df.head()

In [42]:
#X=rawData[['LIMIT_BAL','MARRIAGE', 'AGE', 'SEX_female', 'SEX_male','EDUCATION_graduate school','EDUCATION_high school','EDUCATION_other','EDUCATION_university']]
X=rawData[['LIMIT_BAL','SEX_female', 'SEX_male','EDUCATION_graduate school','EDUCATION_high school','EDUCATION_university']]
#print('Summary of feature sample')
X.head()

,LIMIT_BAL,SEX_female,SEX_male,EDUCATION_graduate school,EDUCATION_high school,EDUCATION_university
0,20000,1,0,0,0,1
1,120000,1,0,0,0,1
2,90000,1,0,0,0,1
3,50000,1,0,0,0,1
4,50000,0,1,0,0,1

In [43]:
#features
#X=df1
#print('Summary of feature sample')
#X.head()

In [44]:
## dependent variable
#what we are trying to predict - #of 
#where no defaults?
#how to incorporate default/non default into this 
y = rawData.loc[:,'default payment next month_default']
y.head()

0    1
1    1
2    0
3    0
4    0
Name: default payment next month_default, dtype: uint8

In [45]:
X_train, X_test, y_train, y_test = train_test_split(X,y, test_size = .30, random_state = 123)
#X_train.shape, X_test.shape

In [46]:
X_train_count = len(X_train.index)
print('The number of observations in the feature training set are:',str(X_train_count))
X_train.head(10)

The number of observations in the feature training set are: 21000

,LIMIT_BAL,SEX_female,SEX_male,EDUCATION_graduate school,EDUCATION_high school,EDUCATION_university
16395,320000,1,0,1,0,0
21448,440000,1,0,1,0,0
20034,160000,1,0,0,1,0
25755,120000,1,0,0,0,1
1438,50000,0,1,0,0,1
13415,290000,1,0,0,0,1
18011,50000,0,1,0,0,1
27677,30000,1,0,1,0,0
11628,200000,0,1,0,0,1
27103,220000,0,1,1,0,0

In [47]:
##why are # of observations the same 
y_train_count = len(y_train.index)
print('The number of observations in the y training set are:',str(y_train_count))
y_train.head()

The number of observations in the y training set are: 21000

16395    0
21448    0
20034    0
25755    0
1438     0
Name: default payment next month_default, dtype: uint8

In [48]:
# =[] creating empty list
#append is adding element to the list
#creating empty list and then adding the algos
algos_Class = []
algos_Class.append(('Random Forest Classifier', RandomForestClassifier()))
algos_Class.append(('Decision Tree Classifier', DecisionTreeClassifier()))
algos_Class.append(('GradientBoostingClassifier', DecisionTreeClassifier()))

In [49]:
results = []
names = []
for name, model in algos_Class:
    result = cross_val_score(model, X,y, cv=3, scoring='accuracy')
    names.append(name)
    results.append(result)

In [50]:
for i in range(len(names)):
    print(names[i],results[i].mean())

Random Forest Classifier 0.7782
Decision Tree Classifier 0.7781333333333333
GradientBoostingClassifier 0.7781666666666668